#Вариант 10. Даны целые положительные числа A и B (A > B). На отрезке длины
A размещено максимально возможное количество отрезков длины B (без наложений).
Используя операцию взятия остатка от деления нацело, найти длину незанятой части
отрезка A.

try:
A=int(input("Введите значение A: "))
B=int(input("Введите значение B: "))


except ValueError:
    if A < B:
        print("A должно быть больше или равно B. Пожалуйста, введите значение B снова.")
        B = int(input("Введите значение B: "))
        

    else:
        
        print(A % B)
        break
            
        
        
       
