'''Дан номер месяца — целое число в диапазоне 1-12 (1 — январь, 2 — февраль и т. д.).
Определить количество дней в этом месяце для невисокосного года.'''

while True:
    try:

        A = int(input('Введите число месяца 1-12:'))

        if A < 1 or A > 12:
            print('неверное число')

        elif A == 2:
            print(28, "дней в этом месяце")
        elif A == (1, 3, 5, 7, 8, 10, 12):
            print(31, "дней в этом месяце")
        elif A == (4, 6, 9, 11):
            print(30, "дней в этом месяце")
        break
    except ValueError:
        print('Неверное значение')
